Courses/7140/Lectures/Testing/overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Testing</title>
<!-- 2018-10-23 Tue 17:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Testing</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A Famous Quote</a></li>
<li><a href="#sec-2">2. Overview/Goals</a>
<ul>
<li><a href="#sec-2-1">2.1. Overview</a></li>
<li><a href="#sec-2-2">2.2. Assumptions</a></li>
<li><a href="#sec-2-3">2.3. Goals of Software Test Design</a></li>
<li><a href="#sec-2-4">2.4. Goal of Debugging</a></li>
<li><a href="#sec-2-5">2.5. Test Suites</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Definition of a "Test"</a></li>
<li><a href="#sec-4">4. Test Generation</a>
<ul>
<li><a href="#sec-4-1">4.1. Research on: Formal Specs  =&gt; Tests</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Test Coverage</a></li>
<li><a href="#sec-6">6. Testing Techniques</a></li>
<li><a href="#sec-7">7. Equivalence Class Testing</a></li>
<li><a href="#sec-8">8. Unit testing, Integration Testing</a></li>
<li><a href="#sec-9">9. Testing of Interactive Programs</a></li>
<li><a href="#sec-10">10. Test Driven Development (TDD)</a></li>
<li><a href="#sec-11">11. Project Specific Lecture</a></li>
<li><a href="#sec-12">12. References</a></li>
<li><a href="#sec-13">13. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A Famous Quote</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
"Testing shows the presence, not the absence, of bugs"
&#x2013; Edsger W. Dijkstra, 1969, Turning Award Winner 1972
</p>
</blockquote>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Overview/Goals</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>You may have understood testing on a very intuitive basis
</li>
<li>Make this understanding more rigorous
</li>
<li>Software testing v testing in engineering
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Assumptions</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Assumption: Did not practice <i>Correct by Design</i>.
</li>

<li>Assumption: Life cycle: We are "done" with development.  We shall
test and debug.  Fix errors, and loop over this step.
</li>

<li>Assumption: We know what the results of a test ought to be.  But,
how do we know?  Not as simple as knowing sqrt(x)!
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Goals of Software Test Design</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>"Hope" to fail.
</li>
<li>Not randomly generated tests
</li>
<li>Known examples of hangs and crashes
</li>
<li>100% coverage of source code
</li>
<li>Edge cases
</li>
<li>Pass "old" tests (Regression Tests)
</li>
<li>Minimize test costs (How "much" testing?)
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Goal of Debugging</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Identify the location where errant behavior begins
</li>
<li>Definition of a "Errant Behavior"
</li>
<li>Can we recognize errant behavior?  How soon?
</li>

<li>Repeatability of Tests (i.e., test results)
<ol class="org-ol">
<li>In the presence of non-determinacy (due to concurrency and
distributed-ness)
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Test Suites</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li><a href="http://en.wikipedia.org/wiki/Smoke_testing">"Smoke" Test</a> description on Wikipedia
</li>
<li>Conformance/ Acceptance Tests [part of Requirements and Specs]
</li>
<li><a href="http://en.wikipedia.org/wiki/Regression_testing">Regression</a> description on Wikipedia
</li>
<li>Unit tests
</li>
<li>Integration tests
</li>
<li>Fuzzing <a href="https://en.wikipedia.org/wiki/Fuzzing">https://en.wikipedia.org/wiki/Fuzzing</a>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Definition of a "Test"</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>test io pair: input and its <b>expected</b> output
<ol class="org-ol">
<li>"test vector" refers to the inputs given at one time
</li>
</ol>
</li>
<li>input includes: actual arguments, state of files, databases, &#x2026;
<ol class="org-ol">
<li>everything the program "reads"
</li>
</ol>
</li>
<li>output: as above
<ol class="org-ol">
<li>everything the program "writes"
</li>
</ol>
</li>
<li>test fails if <b>observed</b> output != expected
</li>
<li>hangs v crashes; both =&gt; fail
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Test Generation</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Generate the io pairs, with high likelihood of test failures
</li>
<li>Assume for now that input is text, and the output is text
</li>
<li>when it is a test of an "internal" component, the io may not be a
"text/text" pair
<ol class="org-ol">
<li>Unit testing solves this problem
</li>
</ol>
</li>
</ol>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Research on: Formal Specs  =&gt; Tests</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>Offutt, Jeff, and Aynur Abdurazik. "Generating tests from UML
specifications." In UML99 &#x2013; The Unified Modeling Language,
pp. 416-429. Springer Berlin Heidelberg, 1999.  Reference
</li>

<li>Pradel, Michael, and Thomas R. Gross. "Leveraging test
generation and specification mining for automated bug
detection without false positives." In 34th International
Conference on Software Engineering (ICSE),
pp. 288-298. IEEE, 2012.  Reference
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Test Coverage</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Can we construct tests that exercise every line of code?
</li>
<li>Statement coverage: execute each statement (at least) once
</li>
<li>Branch coverage: Execute each branch after a condition statement
</li>
<li>Path coverage: Execute all paths through the code
</li>
<li>Tools to track coverage
<ol class="org-ol">
<li>C/C++: gprof, gcov/lcov, googletest, &#x2026;
</li>
<li>Java: eCobertura, <a href="http://codecover.org/">CodeCover</a>, EclEmma, IdeaJ
</li>
</ol>
</li>
<li>Does 100% coverage and no failures, guarantee that software is
fault-free?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Testing Techniques</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Black box testing (aka functional testing): Uses no info re internals
</li>
<li>White box testing (aka structural testing): Uses all info re internals
</li>
<li>Worst/Special Case Testing
<ol class="org-ol">
<li>Errors seem to cluster at boundaries
</li>
<li>What if values fall outside their ranges
</li>
<li>"Torture" (Stress) Tests 
</li>
<li>Donald E. Knuth, "A torture test for TEX",
<a href="http://texdoc.net/texmf-dist/doc/generic/knuth/tex/tripman.pdf">http://texdoc.net/texmf-dist/doc/generic/knuth/tex/tripman.pdf</a>,
163pp, Version 3, January 1990.
</li>
</ol>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Equivalence Class Testing</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>Goal: Reduction of human/computer testing effort
</li>
<li>Divide the test vectors into subsets so that test coverage is the same
</li>
<li>The program is likely constructed so that it either succeeds or 
fails for each of the values in that class
</li>
<li>To test for robustness: for each equivalence class of valid
inputs, devise equivalence classes of invalid inputs
</li>
<li>"cover" a class: Construct tests choosing one value from the class
</li>
<li>The goal is to cover all equivalence classes
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Unit testing, Integration Testing</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li>OOP and programming language (PL) neutral term "unit"  cf. class, method
</li>
<li>Unit test: test one method of one isolated class with one thread
</li>
<li>Tools for unit testing: JUnit and TestNG (both for any JVM based PL)
</li>
<li>Integration test: Test (all) the units together. It occurs after
unit testing and before validation testing.
</li>
<li>see separate lectures
<ol class="org-ol">
<li><a href="./testing-units.html">./testing-units.html</a>
</li>
<li><a href="./testing-integrated.html">./testing-integrated.html</a>
</li>
</ol>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Testing of Interactive Programs</h2>
<div class="outline-text-2" id="text-9">
<ol class="org-ol">
<li>Input generated in "real" time
</li>
<li>Output observed in "real" time
</li>
<li>Correctness judgement?
</li>
<li>Book: Don Libes, "Exploring Expect: A Tcl-based Toolkit for
Automating Interactive Programs", O'Reilly Media, Inc., 2010, 606
pages.  Look it up in WSU Library Safari Books.
</li>
<li>The "expect" is a standard package in Debian/Ubuntu systems
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Test Driven Development (TDD)</h2>
<div class="outline-text-2" id="text-10">
<ol class="org-ol">
<li>Testing impacts other phases of life cycle.
</li>

<li>We assumed above that implementation is "done".  But, testing
should be done during development.
</li>

<li>TDD is done as follows.  Repeat until code is "complete":
<ol class="org-ol">
<li>Add a test.
</li>
<li>Run all tests and see the new one fail.
</li>
<li>Make a (little) change.
</li>
<li>Run all tests and see them succeed.
</li>
<li>Refactor to remove duplication.
</li>
</ol>
</li>

<li><a href="../Maintenance/KentBeck_TDD_byexample.pdf">../Maintenance/KentBeck_TDD_byexample.pdf</a> book extract 137pp.  Ken
Beck made popular the TDD, as a phrase.

<ol class="org-ol">
<li>Full book: Kent Beck, Addison-Wesley, Boston, MA, 2003. 216 pp.
ISBN 0321146530.  Reference.
</li>
<li><a href="http://www.jot.fm/books/review7">Book review</a> by Charles Ashbacher in Journal of Object
Technology, vol. 2, no. 2, March-April 2003, pp. 203-204.
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Project Specific Lecture</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li><a href="../Projects">Summer 2018 Project DITAA</a> Testing 
</li>
<li><a href="https://www.jetbrains.com/help/idea/performing-tests.html">https://www.jetbrains.com/help/idea/performing-tests.html</a>
</li>
<li><a href="https://www.jetbrains.com/help/idea/viewing-code-coverage-results.html">https://www.jetbrains.com/help/idea/viewing-code-coverage-results.html</a>
</li>
<li>IntelliJ videos, several.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> References</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>Glenford J. Myers, Corey Sandler, and Tom Badgett, The Art of
Software Testing, 3rd Edition, John Wiley &amp; Sons,
Inc.  2011. Reference.
</li>

<li><a href="http://en.wikipedia.org/wiki/Mutation_testing">http://en.wikipedia.org/wiki/Mutation_testing</a>  Required Reading.
</li>

<li>Pfleeger and Atlee, Software Engineering, 4e, slides are at
<a href="http://wps.prenhall.com/esm_pfleeger_softengtp_4/">http://wps.prenhall.com/esm_pfleeger_softengtp_4/</a>. Following slides
are Required Reading.
<ol class="org-ol">
<li><a href="./Pfleeger-Atlee-08.ppt">./Pfleeger-Atlee-08.ppt</a> Chapter 8 - Testing the Programs
</li>
<li><a href="./Pfleeger-Atlee-09.ppt">./Pfleeger-Atlee-09.ppt</a> Chapter 9 - Testing the System
</li>
<li><a href="./Pfleeger-Atlee-10.ppt">./Pfleeger-Atlee-10.ppt</a> Chapter 10 - Delivering the System
</li>
</ol>
</li>

<li>Barr, Earl T., et al. "The [Test] Oracle Problem in Software
Testing: A Survey." IEEE transactions on software engineering 41.5
(2015): 507-525pp.  "Given an input for a system, the challenge of
distinguishing the corresponding desired, correct behaviur from
potentially incorrect behavior is called the "test oracle
problem". <a href="http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6963470">http://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=6963470</a>. Required
Reading.
</li>

<li><a href="http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf">http://courses.cs.washington.edu/courses/cse331/16wi/L08/L08-Testing.pdf</a>
   40+ slides.  Recommended Reading.
</li>

<li>Test-Driven Development &#x2013; Extensive Tutorial. Open Source ebook
<a href="https://leanpub.com/tdd-ebook">https://leanpub.com/tdd-ebook</a>  Recommended Reading.
</li>

<li><a href="./TDD/tdd-calpoly-slides.pdf">./TDD/tdd-calpoly-slides.pdf</a> slides  Recommended Reading.
</li>

<li><a href="./TDD/tdd-bneilsen-2006.pdf">./TDD/tdd-bneilsen-2006.pdf</a> 30+ slides, cs.aau.dk; by
Brian Nielsen + Arne Skou    Recommended Reading.
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> End</h2>
<div class="outline-text-2" id="text-13">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2018-07-03
</div>
</body>
</html>
